In [129]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [130]:
Angola_df = pd.read_csv('../Dataset/ANGOLA.csv')

In [131]:
Angola_df.head()

,Date,USD,Unnamed: 2,Date.1,GBP,Unnamed: 5,Date.2,EUR
0,6 Jan 2004,79.01866,NaN,6 Jan 2004,140.84286,NaN,6 Jan 2004,99.68994
1,7 Jan 2004,78.87716,NaN,7 Jan 2004,143.36713,NaN,7 Jan 2004,100.33175
2,8 Jan 2004,78.84478,NaN,8 Jan 2004,143.09539,NaN,8 Jan 2004,99.77018
3,9 Jan 2004,78.90775,NaN,9 Jan 2004,143.27280,NaN,9 Jan 2004,99.38431
4,12 Jan 2004,78.92975,NaN,12 Jan 2004,144.73348,NaN,12 Jan 2004,100.50125

In [132]:
Angola_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4825 entries, 0 to 4824
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        4825 non-null   object
 1   USD         4823 non-null   float64
 2   Unnamed: 2  0 non-null      float64
 3   Date.1      4760 non-null   object
 4   GBP         4756 non-null   float64
 5   Unnamed: 5  0 non-null      float64
 6   Date.2      4764 non-null   object
 7   EUR         4760 non-null   float64
dtypes: float64(5), object(3)
memory usage: 301.7+ KB

In [133]:
Angola_df= Angola_df.drop(columns=['Unnamed: 5','Unnamed: 2', 'Date.1', 'Date.2'], axis = 1)

In [134]:
Angola_df.head()

          Date       USD        GBP        EUR
0   6 Jan 2004  79.01866  140.84286   99.68994
1   7 Jan 2004  78.87716  143.36713  100.33175
2   8 Jan 2004  78.84478  143.09539   99.77018
3   9 Jan 2004  78.90775  143.27280   99.38431
4  12 Jan 2004  78.92975  144.73348  100.50125

In [135]:
Angola_df['Date'] = pd.to_datetime(Angola_df['Date'])

In [136]:
# Convert to a specific string format (e.g., 'YYYY-MM-DD')
Angola_df['Date'] = Angola_df['Date'].dt.strftime('%Y-%m-%d')

In [137]:
Angola_df.head()

         Date       USD        GBP        EUR
0  2004-01-06  79.01866  140.84286   99.68994
1  2004-01-07  78.87716  143.36713  100.33175
2  2004-01-08  78.84478  143.09539   99.77018
3  2004-01-09  78.90775  143.27280   99.38431
4  2004-01-12  78.92975  144.73348  100.50125

In [138]:
USD_Angola_df = Angola_df[['Date', 'USD']]
GBP_Angola_df = Angola_df[['Date', 'GBP']]
EUR_Angola_df = Angola_df[['Date', 'EUR']]

In [139]:
Min_date = Angola_df['Date'].min()
Max_date = Angola_df['Date'].max()

In [140]:
all_dates = pd.date_range(start=Min_date, end=Max_date, freq='D')

In [141]:
dates_df = pd.DataFrame(all_dates, columns=['Date'])

In [142]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7269 entries, 0 to 7268
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    7269 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 56.9 KB

In [143]:
Angola_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4825 entries, 0 to 4824
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4825 non-null   object
 1   USD     4823 non-null   float64
 2   GBP     4756 non-null   float64
 3   EUR     4760 non-null   float64
dtypes: float64(3), object(1)
memory usage: 150.9+ KB

In [144]:
Angola_df['Date'] = pd.to_datetime(Angola_df['Date'])

In [145]:
Angola_merge_df = pd.merge(dates_df, Angola_df, how='left', on= 'Date')

In [146]:
Angola_merge_df.head()

        Date       USD        GBP        EUR
0 2004-01-06  79.01866  140.84286   99.68994
1 2004-01-07  78.87716  143.36713  100.33175
2 2004-01-08  78.84478  143.09539   99.77018
3 2004-01-09  78.90775  143.27280   99.38431
4 2004-01-10       NaN        NaN        NaN

In [147]:
Angola_merge_df = Angola_merge_df[~Angola_merge_df['Date'].dt.weekday.isin([5, 6])]

In [148]:
Angola_merge_df

           Date        USD        GBP        EUR
0    2004-01-06   79.01866  140.84286   99.68994
1    2004-01-07   78.87716  143.36713  100.33175
2    2004-01-08   78.84478  143.09539   99.77018
3    2004-01-09   78.90775  143.27280   99.38431
6    2004-01-12   78.92975  144.73348  100.50125
...         ...        ...        ...        ...
7262 2023-11-24  827.71600        NaN        NaN
7265 2023-11-27  827.71600        NaN        NaN
7266 2023-11-28  827.79300        NaN        NaN
7267 2023-11-29  827.79300        NaN        NaN
7268 2023-11-30  827.79300        NaN        NaN

[5193 rows x 4 columns]

In [149]:
Angola_merge_df = Angola_merge_df.set_index('Date')

In [150]:
Angola_merge_df

                  USD        GBP        EUR
Date
2004-01-06   79.01866  140.84286   99.68994
2004-01-07   78.87716  143.36713  100.33175
2004-01-08   78.84478  143.09539   99.77018
2004-01-09   78.90775  143.27280   99.38431
2004-01-12   78.92975  144.73348  100.50125
...               ...        ...        ...
2023-11-24  827.71600        NaN        NaN
2023-11-27  827.71600        NaN        NaN
2023-11-28  827.79300        NaN        NaN
2023-11-29  827.79300        NaN        NaN
2023-11-30  827.79300        NaN        NaN

[5193 rows x 3 columns]

In [ ]:
# Create the scatter plot
plt.figure(figsize=(10, 6))  # Optional: setting the figure size
plt.scatter(Angola_merge_df['Kz'], Angola_merge_df['USD'], color='blue', alpha=0.6)

# Add labels and title
plt.xlabel('Angolan Kwanza KZ')
plt.ylabel('USD Exchange Rate')
plt.title('Scatter Plot of Date vs USD Exchange Rate')

# Display the plot
plt.xticks(rotation=45)  # Rotate x-axis labels for better readability
plt.tight_layout()  # Adjust layout to prevent clipping of labels
plt.show()